tesi_sissa/hull/examples/data/1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    atmosphere
    {
        type            patch;
        nFaces          798;
        startFace       2538694;
    }
    inlet
    {
        type            patch;
        nFaces          3192;
        startFace       2539492;
    }
    outlet
    {
        type            patch;
        nFaces          3192;
        startFace       2542684;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          798;
        startFace       2545876;
    }
    side
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          7056;
        startFace       2546674;
    }
    midPlane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          27413;
        startFace       2553730;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          27440;
        startFace       2581143;
    }
)

// ************************************************************************* //
