tesi_sissa/hull/examples/data/1/system/ITHACAdict
FoamFile
{
    version     5.0;
    format      ascii;
    class       dictionary;
    object      ITHACAPODdict;
}

EigenSolver eigen;






// ************************************************************************* //
