tesi_sissa/hull/examples/data/1/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      100;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

functions
{
    forces
    {
        type            forces;
        libs            (forces);
        patches         (hull);
        rhoInf          998.8;
        log             on;
        writeControl    timeStep;
        writeInterval   100;
        CofR            (2.929541 0 0.2);
    }

    momentum1
    {
        // Mandatory entries (unmodifiable)
        type            momentum;
        libs            (fieldFunctionObjects);

        // Optional entries (runtime modifiable)
        regionType      all;
        writeMomentum   yes;
        writePosition   yes;
        writeVelocity   yes;
	writeControl    timeStep;
        writeInterval   100;
        p               p;
        U               U;
        rho             rho;
        rhoRef          1.0;

        cylindrical     true;
        origin          (3.028326145 0 0.28616105);
        e1              (1 0 0);
        e3              (0 0 1);
    }
}


// ************************************************************************* //
